SaitovSP/src/Documents/РасходПродуктов/РасходПродуктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходПродуктов</name>
  <registerRecords>AccumulationRegister.ПродуктыРесторана</registerRecords>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.Заказы</types>
    </type>
  </attributes>
  <attributes>
    <name>Повар</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Ингридиенты</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.НоменклатураИнгридиентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдИзм</name>
      <type>
        <types>CatalogRef.УчетнаяЕдиница</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SaitovSP/src/AccumulationRegisters/ПродуктыРесторана/ПродуктыРесторана.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПродуктыРесторана</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УчетнаяЕдиница</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.НоменклатураИнгридиентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ресторан</name>
    <type>
      <types>CatalogRef.Рестораны</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

SaitovSP/src/Documents/РасходПродуктов/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ПродуктыРесторана Расход
	Движения.ПродуктыРесторана.Записывать = Истина;
	
	Для Каждого ТекСтрокаТабличнаяЧасть1 Из Ингридиенты Цикл
		Движение = Движения.ПродуктыРесторана.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Ресторан = ПараметрыСеанса.ТекущийРесторан;
		Движение.Номенклатура = ТекСтрокаТабличнаяЧасть1.Номенклатура;
		Движение.Количество = ТекСтрокаТабличнаяЧасть1.Количество;
		Движение.ЕдиницаИзмерения = ТекСтрокаТабличнаяЧасть1.ЕдИзм;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
